studies/Tu6/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc wallShearStress

#includeFunc graphUniform
(
    name=wallShearStressGraph,
    start=(0.04075 0.00075 0),
    end=(3.04 0.00075 0),
    nPoints=100,
    axis=x,
    wallShearStress
)

#includeFunc graphUniform
(
    name=kGraph,
    start=(0.04075 0.05 0),
    end=(3.04 0.05 0),
    nPoints=100,
    axis=x,
    k
)

// ************************************************************************* //
